quyle-itr-intern/STM32F446RE_MAKE/Old/02-STM32F446RE_XPRINTF/src/lvq_stm32f4_usart.c
/**
  ******************************************************************************

  USART For STM32F446RE
  Author:   LVQ
  Updated:  18st September 2022
	Algorithm: CircularQueue

  ******************************************************************************
*/

#include "lvq_stm32f4_usart.h"

LVQ_USART_Callback_t LVQ_USART_Callback = NULL;

void LVQ_USART_Set_Callback(void* cb)
{
		LVQ_USART_Callback = cb;
}

#define UARTx USART2

struct __FILE { int handle; /* Add whatever you need here */ };
FILE __stdout;
FILE __stdin;

int fputc(int ch, FILE *f) 
{
  while(USART_GetFlagStatus(UARTx, USART_FLAG_TXE) == RESET){}
  USART_SendData(UARTx, ch);
  return(ch);
}

int fgetc(FILE *f) 
{
  char ch;
  while(USART_GetFlagStatus(UARTx, USART_FLAG_RXNE) == RESET){}
  ch = USART_ReceiveData(UARTx);
  return((int)ch);
}

/* int ferror(FILE *f) 
{
  return EOF;
} */

void _ttywrch(int ch) 
{
  while(USART_GetFlagStatus(UARTx, USART_FLAG_TXE) == RESET){}
  USART_SendData(UARTx, ch);
}

void _sys_exit(int return_code) 
{
  while (1); /* endless loop */
}

/**
 * @brief Internal USART struct
 */
typedef struct {
    uint8_t* Buffer;
    uint16_t Size;
    uint16_t Num;
    uint16_t In;
    uint16_t Out;
    uint8_t Initialized;
    uint8_t StringDelimiter;
} LVQ_USART_t;

/* Set variables for buffers */
#ifdef USE_USART1
uint8_t LVQ_USART1_Buffer[LVQ_USART1_BUFFER_SIZE];
#endif
#ifdef USE_USART2
uint8_t LVQ_USART2_Buffer[LVQ_USART2_BUFFER_SIZE];
#endif
#ifdef USE_USART3
uint8_t LVQ_USART3_Buffer[LVQ_USART3_BUFFER_SIZE];
#endif
#ifdef USE_UART4
uint8_t LVQ_UART4_Buffer[LVQ_UART4_BUFFER_SIZE];
#endif
#ifdef USE_UART5
uint8_t LVQ_UART5_Buffer[LVQ_UART5_BUFFER_SIZE];
#endif
#ifdef USE_USART6
uint8_t LVQ_USART6_Buffer[LVQ_USART6_BUFFER_SIZE];
#endif
#ifdef USE_UART7
uint8_t LVQ_UART7_Buffer[LVQ_UART7_BUFFER_SIZE];
#endif
#ifdef USE_UART8
uint8_t LVQ_UART8_Buffer[LVQ_UART8_BUFFER_SIZE];
#endif

#ifdef USE_USART1
LVQ_USART_t LVQ_USART1 = {LVQ_USART1_Buffer, LVQ_USART1_BUFFER_SIZE, 0, 0, 0, 0, USART_STRING_DELIMITER};
#endif
#ifdef USE_USART2
LVQ_USART_t LVQ_USART2 = {LVQ_USART2_Buffer, LVQ_USART2_BUFFER_SIZE, 0, 0, 0, 0, USART_STRING_DELIMITER};
#endif
#ifdef USE_USART3
LVQ_USART_t LVQ_USART3 = {LVQ_USART3_Buffer, LVQ_USART3_BUFFER_SIZE, 0, 0, 0, 0, USART_STRING_DELIMITER};
#endif
#ifdef USE_UART4
LVQ_USART_t LVQ_UART4 = {LVQ_UART4_Buffer, LVQ_UART4_BUFFER_SIZE, 0, 0, 0, 0, USART_STRING_DELIMITER};
#endif
#ifdef USE_UART5
LVQ_USART_t LVQ_UART5 = {LVQ_UART5_Buffer, LVQ_UART5_BUFFER_SIZE, 0, 0, 0, 0, USART_STRING_DELIMITER};
#endif
#ifdef USE_USART6
LVQ_USART_t LVQ_USART6 = {LVQ_USART6_Buffer, LVQ_USART6_BUFFER_SIZE, 0, 0, 0, 0, USART_STRING_DELIMITER};
#endif
#ifdef USE_UART7
LVQ_USART_t LVQ_UART7 = {LVQ_UART7_Buffer, LVQ_UART7_BUFFER_SIZE, 0, 0, 0, 0, USART_STRING_DELIMITER};
#endif
#ifdef USE_UART8
LVQ_USART_t LVQ_UART8 = {LVQ_UART8_Buffer, LVQ_UART8_BUFFER_SIZE, 0, 0, 0, 0, USART_STRING_DELIMITER};
#endif

/* Private functions */
void LVQ_USART1_InitPins(LVQ_USART_PinsPack_t pinspack);
void LVQ_USART2_InitPins(LVQ_USART_PinsPack_t pinspack);
void LVQ_USART3_InitPins(LVQ_USART_PinsPack_t pinspack);
void LVQ_UART4_InitPins(LVQ_USART_PinsPack_t pinspack);
void LVQ_UART5_InitPins(LVQ_USART_PinsPack_t pinspack);
void LVQ_USART6_InitPins(LVQ_USART_PinsPack_t pinspack);
void LVQ_UART7_InitPins(LVQ_USART_PinsPack_t pinspack);
void LVQ_UART8_InitPins(LVQ_USART_PinsPack_t pinspack);
void LVQ_USART_INT_InsertToBuffer(LVQ_USART_t* u, uint8_t c);
LVQ_USART_t* LVQ_USART_INT_GetUsart(USART_TypeDef* USARTx);
uint8_t LVQ_USART_INT_GetSubPriority(USART_TypeDef* USARTx);
uint8_t LVQ_USART_BufferFull(USART_TypeDef* USARTx);

/* Private initializator function */
static void LVQ_USART_INT_Init(
    USART_TypeDef* USARTx,
    LVQ_USART_PinsPack_t pinspack,
    uint32_t baudrate,
    LVQ_USART_HardwareFlowControl_t FlowControl,
    uint32_t Mode,
    uint32_t Parity,
    uint32_t StopBits,
    uint32_t WordLength
);

void LVQ_USART_Init(USART_TypeDef* USARTx, LVQ_USART_PinsPack_t pinspack, uint32_t baudrate) 
{
	#ifdef USE_USART1
			if (USARTx == USART1) {
					LVQ_USART_INT_Init(USART1, pinspack, baudrate, LVQ_USART1_HARDWARE_FLOW_CONTROL, LVQ_USART1_MODE, LVQ_USART1_PARITY, LVQ_USART1_STOP_BITS, LVQ_USART1_WORD_LENGTH);
			}
	#endif
	#ifdef USE_USART2
			if (USARTx == USART2) {
					LVQ_USART_INT_Init(USART2, pinspack, baudrate, LVQ_USART2_HARDWARE_FLOW_CONTROL, LVQ_USART2_MODE, LVQ_USART2_PARITY, LVQ_USART2_STOP_BITS, LVQ_USART2_WORD_LENGTH);
			}
	#endif
	#ifdef USE_USART3
			if (USARTx == USART3) {
					LVQ_USART_INT_Init(USART3, pinspack, baudrate, LVQ_USART3_HARDWARE_FLOW_CONTROL, LVQ_USART3_MODE, LVQ_USART3_PARITY, LVQ_USART3_STOP_BITS, LVQ_USART3_WORD_LENGTH);
			}
	#endif
	#ifdef USE_UART4
			if (USARTx == UART4) {
					LVQ_USART_INT_Init(UART4, pinspack, baudrate, LVQ_UART4_HARDWARE_FLOW_CONTROL, LVQ_UART4_MODE, LVQ_UART4_PARITY, LVQ_UART4_STOP_BITS, LVQ_UART4_WORD_LENGTH);
			}
	#endif
	#ifdef USE_UART5
			if (USARTx == UART5) {
					LVQ_USART_INT_Init(UART5, pinspack, baudrate, LVQ_UART5_HARDWARE_FLOW_CONTROL, LVQ_UART5_MODE, LVQ_UART5_PARITY, LVQ_UART5_STOP_BITS, LVQ_UART5_WORD_LENGTH);
			}
	#endif
	#ifdef USE_USART6
			if (USARTx == USART6) {
					LVQ_USART_INT_Init(USART6, pinspack, baudrate, LVQ_USART6_HARDWARE_FLOW_CONTROL, LVQ_USART6_MODE, LVQ_USART6_PARITY, LVQ_USART6_STOP_BITS, LVQ_USART6_WORD_LENGTH);
			}
	#endif
	#ifdef USE_UART7
			if (USARTx == UART7) {
					LVQ_USART_INT_Init(UART7, pinspack, baudrate, LVQ_UART7_HARDWARE_FLOW_CONTROL, LVQ_UART7_MODE, LVQ_UART7_PARITY, LVQ_UART7_STOP_BITS, LVQ_UART7_WORD_LENGTH);
			}
	#endif
	#ifdef USE_UART8
			if (USARTx == UART8) {
					LVQ_USART_INT_Init(UART8, pinspack, baudrate, LVQ_UART8_HARDWARE_FLOW_CONTROL, LVQ_UART8_MODE, LVQ_UART8_PARITY, LVQ_UART8_STOP_BITS, LVQ_UART8_WORD_LENGTH);
			}
	#endif
}

void LVQ_USART_InitWithFlowControl(USART_TypeDef* USARTx, LVQ_USART_PinsPack_t pinspack, uint32_t baudrate, LVQ_USART_HardwareFlowControl_t FlowControl) 
{
	#ifdef USE_USART1
			if (USARTx == USART1) {
					LVQ_USART_INT_Init(USART1, pinspack, baudrate, FlowControl, LVQ_USART1_MODE, LVQ_USART1_PARITY, LVQ_USART1_STOP_BITS, LVQ_USART1_WORD_LENGTH);
			}
	#endif
	#ifdef USE_USART2
			if (USARTx == USART2) {
					LVQ_USART_INT_Init(USART2, pinspack, baudrate, FlowControl, LVQ_USART2_MODE, LVQ_USART2_PARITY, LVQ_USART2_STOP_BITS, LVQ_USART2_WORD_LENGTH);
			}
	#endif
	#ifdef USE_USART3
			if (USARTx == USART3) {
					LVQ_USART_INT_Init(USART3, pinspack, baudrate, FlowControl, LVQ_USART3_MODE, LVQ_USART3_PARITY, LVQ_USART3_STOP_BITS, LVQ_USART3_WORD_LENGTH);
			}
	#endif
	#ifdef USE_UART4
			if (USARTx == UART4) {
					LVQ_USART_INT_Init(UART4, pinspack, baudrate, FlowControl, LVQ_UART4_MODE, LVQ_UART4_PARITY, LVQ_UART4_STOP_BITS, LVQ_UART4_WORD_LENGTH);
			}
	#endif
	#ifdef USE_UART5
			if (USARTx == UART5) {
					LVQ_USART_INT_Init(UART5, pinspack, baudrate, FlowControl, LVQ_UART5_MODE, LVQ_UART5_PARITY, LVQ_UART5_STOP_BITS, LVQ_UART5_WORD_LENGTH);
			}
	#endif
	#ifdef USE_USART6
			if (USARTx == USART6) {
					LVQ_USART_INT_Init(USART6, pinspack, baudrate, FlowControl, LVQ_USART6_MODE, LVQ_USART6_PARITY, LVQ_USART6_STOP_BITS, LVQ_USART6_WORD_LENGTH);
			}
	#endif
	#ifdef USE_UART7
			if (USARTx == UART7) {
					LVQ_USART_INT_Init(UART7, pinspack, baudrate, FlowControl, LVQ_UART7_MODE, TM_UART7_PARITY, LVQ_UART7_STOP_BITS, LVQ_UART7_WORD_LENGTH);
			}
	#endif
	#ifdef USE_UART8
			if (USARTx == UART8) {
					LVQ_USART_INT_Init(UART8, pinspack, baudrate, FlowControl, LVQ_UART8_MODE, TM_UART8_PARITY, LVQ_UART8_STOP_BITS, LVQ_UART8_WORD_LENGTH);
		  }
	#endif
}

uint8_t LVQ_USART_Getc(USART_TypeDef* USARTx) {
    int8_t c = 0;
    LVQ_USART_t* u = LVQ_USART_INT_GetUsart(USARTx);

    /* Check if we have any data in buffer */
    if (u->Num > 0 || u->In != u->Out) {
        /* Check overflow */
        if (u->Out == u->Size) {
            u->Out = 0;
        }

        /* Read character */
        c = u->Buffer[u->Out];

        /* Increase output pointer */
        u->Out++;

        /* Decrease number of elements */
        if (u->Num) {
            u->Num--;
        }
    }

