quyle-itr-intern/STM32F446RE_MAKE/Old/02-STM32F446RE_XPRINTF/src/lvq_stm32f4_usart.c
    /* Return character */
    return c;
}

uint16_t LVQ_USART_Gets(USART_TypeDef* USARTx, char* buffer, uint16_t bufsize) {
    uint16_t i = 0;

    /* Get USART structure */
    LVQ_USART_t* u = LVQ_USART_INT_GetUsart(USARTx);

    /* Check for any data on USART */
    if (
        u->Num == 0 ||                                              /*!< Buffer empty */
        (
            !LVQ_USART_FindCharacter(USARTx, u->StringDelimiter) && /*!< String delimiter not in buffer */
            u->Num != u->Size                                       /*!< Buffer is not full */
        ) ) 
		{
        /* Return 0 */
        return 0;
    }

    /* If available buffer size is more than 0 characters */
    while (i < (bufsize - 1)) {
        /* We have available data */
        buffer[i] = (char) LVQ_USART_Getc(USARTx);

        /* Check for end of string */
        if ((uint8_t) buffer[i] == (uint8_t) u->StringDelimiter) {
            /* Done */
            break;
        }

        /* Increase */
        i++;
    }

    /* Add zero to the end of string */
    buffer[++i] = 0;
		/* LVQ_USART_ClearBuffer(USARTx); */
    /* Return number of characters in buffer */
    return i;
}

uint8_t LVQ_USART_BufferEmpty(USART_TypeDef* USARTx) {
    LVQ_USART_t* u = LVQ_USART_INT_GetUsart(USARTx);

    /* Check if number of characters is zero in buffer */
    return (u->Num == 0 && u->In == u->Out);
}

uint8_t LVQ_USART_BufferFull(USART_TypeDef* USARTx) {
    LVQ_USART_t* u = LVQ_USART_INT_GetUsart(USARTx);

    /* Check if number of characters is the same as buffer size */
    return (u->Num == u->Size);
}

void LVQ_USART_ClearBuffer(USART_TypeDef* USARTx) {
    LVQ_USART_t* u = LVQ_USART_INT_GetUsart(USARTx);

    /* Reset variables */
    u->Num = 0;
    u->In = 0;
    u->Out = 0;
}

void LVQ_USART_SetCustomStringEndCharacter(USART_TypeDef* USARTx, uint8_t Character) {
    /* Get USART structure */
    LVQ_USART_t* u = LVQ_USART_INT_GetUsart(USARTx);

    /* Set delimiter */
    u->StringDelimiter = Character;
}

uint8_t LVQ_USART_FindCharacter(USART_TypeDef* USARTx, uint8_t c) {
    uint16_t num, out;
    LVQ_USART_t* u = LVQ_USART_INT_GetUsart(USARTx);

    /* Temp variables */
    num = u->Num;
    out = u->Out;

    while (num > 0) {
        /* Check overflow */
        if (out == u->Size) {
            out = 0;
        }

        /* Check if characters matches */
        if ((uint8_t) u->Buffer[out] == (uint8_t) c) {
            /* Character found */
            return 1;
        }

        /* Set new variables */
        out++;
        num--;
    }

    /* Character is not in buffer */
    return 0;
}

void LVQ_USART_Puts(USART_TypeDef* USARTx, char* str) {
    LVQ_USART_t* u = LVQ_USART_INT_GetUsart(USARTx);
    /* If we are not initialized */
    if (u->Initialized == 0) {
        return;
    }

    /* Go through entire string */
    while (*str) {
        /* Wait to be ready, buffer empty */
        USART_WAIT(USARTx);
        /* Send data */
        USARTx->DR = (uint16_t)(*str++ & 0x01FF);
        /* Wait to be ready, buffer empty */
        USART_WAIT(USARTx);
    }
}

void LVQ_USART_Send(USART_TypeDef* USARTx, uint8_t* DataArray, uint16_t count) 
{
    uint16_t i;
    LVQ_USART_t* u = LVQ_USART_INT_GetUsart(USARTx);
    /* If we are not initialized */
    if (u->Initialized == 0) {
        return;
    }

    /* Go through entire data array */
    for (i = 0; i < count; i++) {
        /* Wait to be ready, buffer empty */
        USART_WAIT(USARTx);
        /* Send data */
        USARTx->DR = (uint16_t)(DataArray[i]);
        /* Wait to be ready, buffer empty */
        USART_WAIT(USARTx);
    }
}

/* Private functions */
void LVQ_USART_INT_InsertToBuffer(LVQ_USART_t* u, uint8_t c) 
{
    /* Still available space in buffer */
    if (u->Num < u->Size) {
        /* Check overflow */
        if (u->In == u->Size) {
            u->In = 0;
        }
        /* Add to buffer */
        u->Buffer[u->In] = c;
        u->In++;
        u->Num++;
    }
}

void LVQ_USART_InitCustomPinsCallback(USART_TypeDef* USARTx, uint16_t AlternateFunction) 
{
    /* Custom user function. */
    /* In case user needs functionality for custom pins, this function should be declared outside this library */
		/* Check for proper USART */
		if (USARTx == USART1) 
		{
			/* Initialize custom pins */
			#if DEFINE_USART1_CUSTOM_1
				/* TX pin = PB6 */
				LVQ_GPIO_InitAlternate(GPIOB, GPIO_PIN_6, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_UP, LVQ_GPIO_Speed_Low, AlternateFunction);
				/* RX pin = PA10 */
				LVQ_GPIO_InitAlternate(GPIOA, GPIO_PIN_10, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_UP, LVQ_GPIO_Speed_Low, AlternateFunction);
			#endif
			
			#if DEFINE_USART1_CUSTOM_2
				/* TX pin = PA9 */
				LVQ_GPIO_InitAlternate(GPIOA, GPIO_PIN_9, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_UP, LVQ_GPIO_Speed_Low, AlternateFunction);
				/* RX pin = PB7 */
				LVQ_GPIO_InitAlternate(GPIOB, GPIO_PIN_7, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_UP, LVQ_GPIO_Speed_Low, AlternateFunction);
			#endif
		}
}

LVQ_USART_t* LVQ_USART_INT_GetUsart(USART_TypeDef* USARTx) 
{
    LVQ_USART_t* u;

		#ifdef USE_USART1
				if (USARTx == USART1) {
						u = &LVQ_USART1;
				}
		#endif
		#ifdef USE_USART2
				if (USARTx == USART2) {
						u = &LVQ_USART2;
				}
		#endif
		#ifdef USE_USART3
				if (USARTx == USART3) {
						u = &LVQ_USART3;
				}
		#endif
		#ifdef USE_UART4
				if (USARTx == UART4) {
						u = &LVQ_UART4;
				}
		#endif
		#ifdef USE_UART5
				if (USARTx == UART5) {
						u = &LVQ_UART5;
				}
		#endif
		#ifdef USE_USART6
				if (USARTx == USART6) {
						u = &LVQ_USART6;
				}
		#endif
		#ifdef USE_UART7
				if (USARTx == UART7) {
						u = &LVQ_UART7;
				}
		#endif
		#ifdef USE_UART8
				if (USARTx == UART8) {
						u = &LVQ_UART8;
				}
		#endif

    return u;
}

uint8_t LVQ_USART_INT_GetSubPriority(USART_TypeDef* USARTx) 
{
    uint8_t u;

		#ifdef USE_USART1
				if (USARTx == USART1) {
						u = 1;
				}
		#endif
		#ifdef USE_USART2
				if (USARTx == USART2) {
						u = 2;
				}
		#endif
		#ifdef USE_USART3
				if (USARTx == USART3) {
						u = 3;
				}
		#endif
		#ifdef USE_UART4
				if (USARTx == UART4) {
						u = 4;
				}
		#endif
		#ifdef USE_UART5
				if (USARTx == UART5) {
						u = 5;
				}
		#endif
		#ifdef USE_USART6
				if (USARTx == USART6) {
						u = 6;
				}
		#endif
		#ifdef USE_UART7
				if (USARTx == UART7) {
						u = 7;
				}
		#endif
		#ifdef USE_UART8
				if (USARTx == UART8) {
						u = 8;
				}
		#endif

