quyle-itr-intern/STM32F446RE_MAKE/Old/02-STM32F446RE_XPRINTF/src/lvq_stm32f4_usart.c
    return u;
}

#ifdef USE_USART1
void LVQ_USART1_InitPins(LVQ_USART_PinsPack_t pinspack) {
    /* Init pins */
#if defined(GPIOA)
    if (pinspack == LVQ_USART_PinsPack_1) {
        LVQ_GPIO_InitAlternate(GPIOA, GPIO_Pin_9 | GPIO_Pin_10, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_UP, LVQ_GPIO_Speed_High, GPIO_AF_USART1);
    }
#endif
#if defined(GPIOB)
    if (pinspack == LVQ_USART_PinsPack_2) {
        LVQ_GPIO_InitAlternate(GPIOB, GPIO_Pin_6 | GPIO_Pin_7, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_UP, LVQ_GPIO_Speed_High, GPIO_AF_USART1);
    }
#endif
    if (pinspack == LVQ_USART_PinsPack_Custom) {
        /* Init custom pins, callback used */
        LVQ_USART_InitCustomPinsCallback(USART1, GPIO_AF_USART1);
    }
}
#endif

#ifdef USE_USART2
void LVQ_USART2_InitPins(LVQ_USART_PinsPack_t pinspack) {
    /* Init pins */
#if defined(GPIOA)
    if (pinspack == LVQ_USART_PinsPack_1) {
        LVQ_GPIO_InitAlternate(GPIOA, GPIO_Pin_2 | GPIO_Pin_3, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_UP, LVQ_GPIO_Speed_High, GPIO_AF_USART2);
    }
#endif
#if defined(GPIOD)
    if (pinspack == LVQ_USART_PinsPack_2) {
        LVQ_GPIO_InitAlternate(GPIOD, GPIO_Pin_5 | GPIO_Pin_6, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_UP, LVQ_GPIO_Speed_High, GPIO_AF_USART2);
    }
#endif
    if (pinspack == LVQ_USART_PinsPack_Custom) {
        /* Init custom pins, callback used */
        LVQ_USART_InitCustomPinsCallback(USART2, GPIO_AF_USART2);
    }
}
#endif

#ifdef USE_USART3
void LVQ_USART3_InitPins(LVQ_USART_PinsPack_t pinspack) {
    /* Init pins */
#if defined(GPIOB)
    if (pinspack == LVQ_USART_PinsPack_1) {
        LVQ_GPIO_InitAlternate(GPIOB, GPIO_Pin_10, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_UP, LVQ_GPIO_Speed_High, GPIO_AF_USART3);
				LVQ_GPIO_InitAlternate(GPIOC, GPIO_Pin_5, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_UP, LVQ_GPIO_Speed_High, GPIO_AF_USART3);
    }
#endif
#if defined(GPIOC)
    if (pinspack == LVQ_USART_PinsPack_2) {
        LVQ_GPIO_InitAlternate(GPIOC, GPIO_Pin_10 | GPIO_Pin_11, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_UP, LVQ_GPIO_Speed_High, GPIO_AF_USART3);
    }
#endif
#if defined(GPIOD)
    if (pinspack == LVQ_USART_PinsPack_3) {
        LVQ_GPIO_InitAlternate(GPIOD, GPIO_Pin_8 | GPIO_Pin_9, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_UP, LVQ_GPIO_Speed_High, GPIO_AF_USART3);
    }
#endif
    if (pinspack == LVQ_USART_PinsPack_Custom) {
        /* Init custom pins, callback used */
        LVQ_USART_InitCustomPinsCallback(USART3, GPIO_AF_USART3);
    }
}
#endif

#ifdef USE_UART4
void LVQ_UART4_InitPins(LVQ_USART_PinsPack_t pinspack) {
    /* Init pins */
#if defined(GPIOA)
    if (pinspack == LVQ_USART_PinsPack_1) {
        LVQ_GPIO_InitAlternate(GPIOA, GPIO_Pin_0 | GPIO_Pin_1, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_UP, LVQ_GPIO_Speed_High, GPIO_AF_UART4);
    }
#endif
#if defined(GPIOC)
    if (pinspack == LVQ_USART_PinsPack_2) {
        LVQ_GPIO_InitAlternate(GPIOC, GPIO_Pin_10 | GPIO_Pin_11, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_UP, LVQ_GPIO_Speed_High, GPIO_AF_UART4);
    }
#endif
    if (pinspack == LVQ_USART_PinsPack_Custom) {
        /* Init custom pins, callback used */
        LVQ_USART_InitCustomPinsCallback(UART4, GPIO_AF_UART4);
    }
}
#endif

#ifdef USE_UART5
void LVQ_UART5_InitPins(LVQ_USART_PinsPack_t pinspack) {
    /* Init pins */
#if defined(GPIOC) && defined(GPIOD)
    if (pinspack == LVQ_USART_PinsPack_1) {
        LVQ_GPIO_InitAlternate(GPIOC, GPIO_Pin_12, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_UP, LVQ_GPIO_Speed_High, GPIO_AF_UART5);
        LVQ_GPIO_InitAlternate(GPIOD, GPIO_Pin_2, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_UP, LVQ_GPIO_Speed_High, GPIO_AF_UART5);
    }
#endif
    if (pinspack == LVQ_USART_PinsPack_Custom) {
        /* Init custom pins, callback used */
        LVQ_USART_InitCustomPinsCallback(UART5, GPIO_AF_UART5);
    }
}
#endif

#ifdef USE_USART6
void LVQ_USART6_InitPins(LVQ_USART_PinsPack_t pinspack) {
    /* Init pins */
#if defined(GPIOC)
    if (pinspack == LVQ_USART_PinsPack_1) {
        LVQ_GPIO_InitAlternate(GPIOC, GPIO_Pin_6 | GPIO_Pin_7, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_UP, LVQ_GPIO_Speed_High, GPIO_AF_USART6);
    }
#endif
#if defined(GPIOG)
    if (pinspack == LVQ_USART_PinsPack_2) {
        LVQ_GPIO_InitAlternate(GPIOG, GPIO_Pin_14 | GPIO_Pin_9, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_UP, LVQ_GPIO_Speed_High, GPIO_AF_USART6);
    }
#endif
    if (pinspack == LVQ_USART_PinsPack_Custom) {
        /* Init custom pins, callback used */
        LVQ_USART_InitCustomPinsCallback(USART6, GPIO_AF_USART6);
    }
}
#endif

#ifdef USE_UART7
void LVQ_UART7_InitPins(LVQ_USART_PinsPack_t pinspack) {
    /* Init pins */
#if defined(GPIOE)
    if (pinspack == LVQ_USART_PinsPack_1) {
        LVQ_GPIO_InitAlternate(GPIOE, GPIO_Pin_8 | GPIO_Pin_7, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_UP, LVQ_GPIO_Speed_High, GPIO_AF_UART7);
    }
#endif
#if defined(GPIOF)
    if (pinspack == LVQ_USART_PinsPack_2) {
        LVQ_GPIO_InitAlternate(GPIOF, GPIO_Pin_7 | GPIO_Pin_6, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_UP, LVQ_GPIO_Speed_High, GPIO_AF_UART7);
    }
#endif
    if (pinspack == TM_USART_PinsPack_Custom) {
        /* Init custom pins, callback used */
        TM_USART_InitCustomPinsCallback(UART7, GPIO_AF_UART7);
    }
}
#endif

#ifdef USE_UART8
void LVQ_UART8_InitPins(LVQ_USART_PinsPack_t pinspack) {
    /* Init pins */
#if defined(GPIOE)
    if (pinspack == LVQ_USART_PinsPack_1) {
        LVQ_GPIO_InitAlternate(GPIOE, GPIO_Pin_1 | GPIO_Pin_0, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_UP, LVQ_GPIO_Speed_High, GPIO_AF_UART8);
    }
#endif
    if (pinspack == LVQ_USART_PinsPack_Custom) {
        /* Init custom pins, callback used */
        LVQ_USART_InitCustomPinsCallback(UART8, GPIO_AF_UART8);
    }
}
#endif

static void LVQ_USART_INT_Init(
		USART_TypeDef* USARTx, 
		LVQ_USART_PinsPack_t pinspack,
    uint32_t baudrate,
    LVQ_USART_HardwareFlowControl_t FlowControl,
    uint32_t Mode,
    uint32_t Parity,
    uint32_t StopBits,
    uint32_t WordLength ) {
    LVQ_USART_t* u = LVQ_USART_INT_GetUsart(USARTx);
		
		/* Fill NVIC settings */
		/* Compute the Corresponding IRQ Priority --------------------------------*/
		uint8_t tmppriority = 0x00, tmppre = 0x00, tmpsub = 0x0F;

