quyle-itr-intern/STM32F446RE_MAKE/Old/02-STM32F446RE_XPRINTF/src/lvq_stm32f4_usart.c
		/*
		*     @arg NVIC_PriorityGroup_0: 0 bits for pre-emption priority : 0x700
		*                                4 bits for subpriority
		*     @arg NVIC_PriorityGroup_1: 1 bits for pre-emption priority : 0x600
		*                                3 bits for subpriority
		*     @arg NVIC_PriorityGroup_2: 2 bits for pre-emption priority : 0x500
		*                                2 bits for subpriority 
		*     @arg NVIC_PriorityGroup_3: 3 bits for pre-emption priority : 0x400
		*                                1 bits for subpriority
		*     @arg NVIC_PriorityGroup_4: 4 bits for pre-emption priority : 0x300
		*                                0 bits for subpriority
		*/
	
		SCB->AIRCR = 0x500;	
		
		tmppriority = (0x700 - ((SCB->AIRCR) & (uint32_t)0x700))>> 0x08;
		tmppre = (0x04 - tmppriority);
		tmpsub = tmpsub >> tmppriority;

    tmppriority = USART_NVIC_PRIORITY << tmppre;
    tmppriority |=  (uint8_t)(LVQ_USART_INT_GetSubPriority(USARTx) & tmpsub);
		
		tmppriority = tmppriority << 0x04;
		
    /*
     * Initialize USARTx pins
     * Set channel for USARTx NVIC
     */
#ifdef USE_USART1
    if (USARTx == USART1) {
        /* Enable USART clock */
        RCC->APB2ENR |= RCC_APB2ENR_USART1EN;

        /* Init pins */
        LVQ_USART1_InitPins(pinspack);

        /* Enable the Selected IRQ Channels --------------------------------------*/
				NVIC->ISER[USART1_IRQn >> 0x05] = (uint32_t)0x01 << (USART1_IRQn & (uint8_t)0x1F);
				
				/* IRQ Priority */
				NVIC->IP[USART1_IRQn] = tmppriority;
    }
#endif
#ifdef USE_USART2
    if (USARTx == USART2) {
        /* Enable USART clock */
        RCC->APB1ENR |= RCC_APB1ENR_USART2EN;

        /* Init pins */
        LVQ_USART2_InitPins(pinspack);

        /* Enable the Selected IRQ Channels --------------------------------------*/
				NVIC->ISER[USART2_IRQn >> 0x05] = (uint32_t)0x01 << (USART2_IRQn & (uint8_t)0x1F);
			
				/* IRQ Priority */
				NVIC->IP[USART2_IRQn] = tmppriority;
    }
#endif
#ifdef USE_USART3
    if (USARTx == USART3) {
        /* Enable USART clock */
        RCC->APB1ENR |= RCC_APB1ENR_USART3EN;

        /* Init pins */
        LVQ_USART3_InitPins(pinspack);

        /* Enable the Selected IRQ Channels --------------------------------------*/
				NVIC->ISER[USART3_IRQn >> 0x05] = (uint32_t)0x01 << (USART3_IRQn & (uint8_t)0x1F);
			
				/* IRQ Priority */
				NVIC->IP[USART3_IRQn] = tmppriority;
    }
#endif
#ifdef USE_UART4
    if (USARTx == UART4) {
        /* Enable UART clock */
        RCC->APB1ENR |= RCC_APB1ENR_UART4EN;

        /* Init pins */
        LVQ_UART4_InitPins(pinspack);

        /* Enable the Selected IRQ Channels --------------------------------------*/
				NVIC->ISER[UART4_IRQn >> 0x05] = (uint32_t)0x01 << (UART4_IRQn & (uint8_t)0x1F);
			
				/* IRQ Priority */
				NVIC->IP[UART4_IRQn] = tmppriority;
    }
#endif
#ifdef USE_UART5
    if (USARTx == UART5) {
        /* Enable UART clock */
        RCC->APB1ENR |= RCC_APB1ENR_UART5EN;

        /* Init pins */
        LVQ_UART5_InitPins(pinspack);

        /* Enable the Selected IRQ Channels --------------------------------------*/
				NVIC->ISER[UART5_IRQn >> 0x05] = (uint32_t)0x01 << (UART5_IRQn & (uint8_t)0x1F);
			
				/* IRQ Priority */
				NVIC->IP[UART5_IRQn] = tmppriority;
    }
#endif
#ifdef USE_USART6
    if (USARTx == USART6) {
        /* Enable UART clock */
        RCC->APB2ENR |= RCC_APB2ENR_USART6EN;

        /* Init pins */
        LVQ_USART6_InitPins(pinspack);

        /* Enable the Selected IRQ Channels --------------------------------------*/
				NVIC->ISER[USART6_IRQn >> 0x05] = (uint32_t)0x01 << (USART6_IRQn & (uint8_t)0x1F);
			
				/* IRQ Priority */
				NVIC->IP[USART6_IRQn] = tmppriority;
    }
#endif
#ifdef USE_UART7
    if (USARTx == UART7) {
        /* Enable UART clock */
        RCC->APB1ENR |= RCC_APB1ENR_UART7EN;

        /* Init pins */
        LVQ_UART7_InitPins(pinspack);

        /* Enable the Selected IRQ Channels --------------------------------------*/
				NVIC->ISER[UART7_IRQn >> 0x05] = (uint32_t)0x01 << (UART7_IRQn & (uint8_t)0x1F);
		
				/* IRQ Priority */
				NVIC->IP[UART7_IRQn] = tmppriority;
    }
#endif
#ifdef USE_UART8
    if (USARTx == UART8) {
        /* Enable UART clock */
        RCC->APB1ENR |= RCC_APB1ENR_UART8EN;

        /* Init pins */
        LVQ_UART8_InitPins(pinspack);

        /* Enable the Selected IRQ Channels --------------------------------------*/
				NVIC->ISER[UART8_IRQn >> 0x05] = (uint32_t)0x01 << (UART8_IRQn & (uint8_t)0x1F);
				
				/* IRQ Priority */
				NVIC->IP[UART8_IRQn] = tmppriority;
    }
#endif

    /* Deinit USART, force reset */
		
		/* Set USART baudrate */
		if(USARTx == USART1 || USARTx == USART6)
		{
			#ifdef STM32F401xx 
					double USARTDIV = 84000000.0/(16*baudrate);
			#elif STM32F446xx
					double USARTDIV = 90000000.0/(16*baudrate);
			#endif
			USARTx->BRR = (uint16_t)( ((uint16_t) USARTDIV << 4) | (uint16_t) (USARTDIV - (uint16_t)USARTDIV)*16);
		}
    else
		{
			#ifdef STM32F401xx 
					double USARTDIV = 42000000.0/(16*baudrate);
			#elif STM32F446xx
					double USARTDIV = 45000000.0/(16*baudrate);
			#endif
			USARTx->BRR = (uint16_t)( ((uint16_t) USARTDIV << 4) | (uint16_t) (USARTDIV - (uint16_t)USARTDIV)*16);
		}
		
		/* Transmitter enable set bit TE, Receiver enable set bit RE */
		USARTx->CR1 |= Mode;
		
		/* Word length set bit M to 8 Data bits, clear bit M to 9 Data bits */
		USART1->CR1 &= ~(1<<12);
		USARTx->CR1 |= Parity;
		
		/* STOP bits 00: 1 Stop bit, 01: 0.5 Stop bit, 10: 2 Stop bits, 11: 1.5 Stop bit */
		USARTx->CR2 &= ~(3<<12);
		USARTx->CR2 |= StopBits;

    /* We are not initialized */
    u->Initialized = 0;

    do {
        volatile uint32_t x = 0xFFF;
        while (x--);
    } while (0);

    /* Init */

    /* Enable RX interrupt */
    USARTx->CR1 |= USART_CR1_RXNEIE;
		
		/* if use interrupt idleie */
		USARTx->CR1 |= USART_CR1_IDLEIE;

    /* We are initialized now */
    u->Initialized = 1;

    /* Enable USART peripheral */
    USARTx->CR1 |= USART_CR1_UE;
}

