quyle-itr-intern/STM32F446RE_MAKE/Old/02-STM32F446RE_XPRINTF/src/lvq_stm32f4_usart.c
#ifdef USE_USART1
void USART1_IRQHandler(void) {
		if(USART1->SR & USART_FLAG_IDLE)
		{
				USART1->SR &= ~USART_FLAG_IDLE;
				USART1->DR;
		}
    /* Check if interrupt was because data is received */
    if (USART1->SR & USART_SR_RXNE) {
#ifdef 	LVQ_USART1_USE_CUSTOM_IRQ
        /* Call user function */
					LVQ_USART1_ReceiveHandler(USART1->DR);
#else
			#ifdef LVQ_USART1_USE_UPDATE_FIRMWARE
					LVQ_USART_Callback(USART1->DR);
			#else
        /* Put received data into internal buffer */
        LVQ_USART_INT_InsertToBuffer(&LVQ_USART1, USART1->DR);
			#endif
#endif
    }
}
#endif

#ifdef LVQ_RECEIVE_IT_DATA_USART2
		extern LVQ_USART_Data_RXTX_t LVQ_Usart2;
#endif

#ifdef USE_USART2
void USART2_IRQHandler(void) {
		if(USART2->SR & USART_FLAG_IDLE)
		{
				USART2->SR &= ~USART_FLAG_IDLE;
				USART2->DR;
		}
    /* Check if interrupt was because data is received */
    if (USART2->SR & USART_SR_RXNE) {
#ifdef LVQ_USART2_USE_CUSTOM_IRQ
        /* Call user function */
        LVQ_USART2_ReceiveHandler(USART2->DR);
#else
				#ifdef LVQ_USART2_USE_UPDATE_FIRMWARE
					LVQ_USART_Callback(USART2->DR);
				#else
        /* Put received data into internal buffer */
        LVQ_USART_INT_InsertToBuffer(&LVQ_USART2, USART2->DR);
				#endif
			
				#ifdef LVQ_RECEIVE_IT_DATA_USART2
						LVQ_USART_Receive_IT(&LVQ_Usart2);
				#endif
#endif
    }
}
#endif

#ifdef LVQ_RECEIVE_IT_DATA_USART3
		extern LVQ_USART_Data_RXTX_t LVQ_Usart3;
#endif

#ifdef USE_USART3
void USART3_IRQHandler(void) {
    /* Check if interrupt was because data is received */
    if (USART3->SR & USART_SR_RXNE) {
#ifdef LVQ_USART3_USE_CUSTOM_IRQ
        /* Call user function */
        LVQ_USART3_ReceiveHandler(USART3->DR);
#else
				#ifdef LVQ_USART3_USE_UPDATE_FIRMWARE
					LVQ_USART_Callback(USART3->DR);
				#else
        /* Put received data into internal buffer */
        LVQ_USART_INT_InsertToBuffer(&LVQ_USART3, USART3->DR);
				#endif
			
				#ifdef LVQ_RECEIVE_IT_DATA_USART3
						LVQ_USART_Receive_IT(&LVQ_Usart3);
				#endif
#endif
    }
		#ifdef LVQ_RECEIVE_IT_DATA_USART3
			if(USART3->SR & USART_FLAG_IDLE)
			{
					uint16_t count = LVQ_Usart3.RxXferSize - LVQ_Usart3.RxXferCount;
					USART3->SR &= ~USART_FLAG_IDLE;
					USART3->DR;
					LVQ_Usart3.pRxBuffer -= LVQ_Usart3.RxXferSize - LVQ_Usart3.RxXferCount;
					LVQ_Usart3.RxXferCount = LVQ_Usart3.RxXferSize;
					LVQ_USART_ReceiveIT_Done(&LVQ_Usart3, count);
			}
		#endif
}
#endif

#ifdef USE_UART4
void UART4_IRQHandler(void) {
    /* Check if interrupt was because data is received */
    if (UART4->SR & USART_SR_RXNE) {
#ifdef LVQ_UART4_USE_CUSTOM_IRQ
        /* Call user function */
        LVQ_UART4_ReceiveHandler(UART4->DR);
#else
				#ifdef LVQ_USART4_USE_UPDATE_FIRMWARE
					LVQ_USART_Callback(USART4->DR);
				#else
        /* Put received data into internal buffer */
        LVQ_USART_INT_InsertToBuffer(&LVQ_UART4, UART4->DR);
				#endif
#endif
    }
}
#endif

#ifdef USE_UART5
void UART5_IRQHandler(void) {
    /* Check if interrupt was because data is received */
    if (UART5->SR & USART_SR_RXNE) {
#ifdef LVQ_UART5_USE_CUSTOM_IRQ
        /* Call user function */
        LVQ_UART5_ReceiveHandler(UART5->DR);
#else
        /* Put received data into internal buffer */
        LVQ_USART_INT_InsertToBuffer(&LVQ_UART5, UART5->DR);
#endif
    }
}
#endif

#ifdef USE_USART6
void USART6_IRQHandler(void) {
    /* Check if interrupt was because data is received */
    if (USART6->SR & USART_SR_RXNE) {
#ifdef LVQ_USART6_USE_CUSTOM_IRQ
        /* Call user function */
        LVQ_USART6_ReceiveHandler(USART6->DR);
#else
        /* Put received data into internal buffer */
        LVQ_USART_INT_InsertToBuffer(&LVQ_USART6, USART6->DR);
#endif
    }
}
#endif

#ifdef USE_UART7
void UART7_IRQHandler(void) {
    /* Check if interrupt was because data is received */
    if (UART7->SR & USART_SR_RXNE) {
#ifdef LVQ_UART7_USE_CUSTOM_IRQ
        /* Call user function */
        LVQ_UART7_ReceiveHandler(UART7->DR);
#else
        /* Put received data into internal buffer */
        LVQ_USART_INT_InsertToBuffer(&LVQ_UART7, UART7->DR);
#endif
    }
}
#endif

#ifdef USE_UART8
void UART8_IRQHandler(void) {
    /* Check if interrupt was because data is received */
    if (UART8->SR & USART_SR_RXNE) {
#ifdef LVQ_UART8_USE_CUSTOM_IRQ
        /* Call user function */
        LVQ_UART8_ReceiveHandler(UART8->DR);
#else
        /* Put received data into internal buffer */
        LVQ_USART_INT_InsertToBuffer(&LVQ_UART8, UART8->DR);
#endif
    }
}
#endif
